In [1]:
import numpy as np
import pandas as pd

In [2]:
df= pd.read_excel(r'C:\Users\ddugky\Downloads\olympicData\salesData.xlsx')

In [3]:
df

   S.no  Sales 2015        Dept.  Profit Region
0     1          23  Electronics      56   East
1     2          45    Marketing      45  North
2     3          78  Counselling      78   West
3     4          34           IT       3   West
4     5           8        Sales      14  South
5     6          55           HR      66   West

In [4]:
#loc & iloc
#loc-----> Dataframe.loc()/[]
df.loc()

In [5]:
df.loc[5]

S.no             6
Sales 2015      55
Dept.           HR
Profit          66
Region        West
Name: 5, dtype: object

In [6]:
df.loc[[2]]

   S.no  Sales 2015        Dept.  Profit Region
2     3          78  Counselling      78   West

In [7]:
df.loc[4]

S.no              5
Sales 2015        8
Dept.         Sales
Profit           14
Region        South
Name: 4, dtype: object

In [8]:
df.loc[[4]]

   S.no  Sales 2015  Dept.  Profit Region
4     5           8  Sales      14  South

In [9]:
df

   S.no  Sales 2015        Dept.  Profit Region
0     1          23  Electronics      56   East
1     2          45    Marketing      45  North
2     3          78  Counselling      78   West
3     4          34           IT       3   West
4     5           8        Sales      14  South
5     6          55           HR      66   West

In [10]:
df.loc[[2,5]]

   S.no  Sales 2015        Dept.  Profit Region
2     3          78  Counselling      78   West
5     6          55           HR      66   West

In [11]:
df

   S.no  Sales 2015        Dept.  Profit Region
0     1          23  Electronics      56   East
1     2          45    Marketing      45  North
2     3          78  Counselling      78   West
3     4          34           IT       3   West
4     5           8        Sales      14  South
5     6          55           HR      66   West

In [12]:
df.loc[[4],'Dept.']

4    Sales
Name: Dept., dtype: object

In [13]:
#slicing
df.loc[3:5]

   S.no  Sales 2015  Dept.  Profit Region
3     4          34     IT       3   West
4     5           8  Sales      14  South
5     6          55     HR      66   West

In [14]:
df.loc[[True,False,True,False,True,True]]

   S.no  Sales 2015        Dept.  Profit Region
0     1          23  Electronics      56   East
2     3          78  Counselling      78   West
4     5           8        Sales      14  South
5     6          55           HR      66   West

In [15]:
df

   S.no  Sales 2015        Dept.  Profit Region
0     1          23  Electronics      56   East
1     2          45    Marketing      45  North
2     3          78  Counselling      78   West
3     4          34           IT       3   West
4     5           8        Sales      14  South
5     6          55           HR      66   West

In [16]:
df.loc[0:3,['Region','Profit']]

  Region  Profit
0   East      56
1  North      45
2   West      78
3   West       3

In [17]:
#find the info and tell me through data that what department,region
# have earn some profit.
df.loc[0:3,['Dept.','Region','Profit']]

         Dept. Region  Profit
0  Electronics   East      56
1    Marketing  North      45
2  Counselling   West      78
3           IT   West       3

In [18]:
df

   S.no  Sales 2015        Dept.  Profit Region
0     1          23  Electronics      56   East
1     2          45    Marketing      45  North
2     3          78  Counselling      78   West
3     4          34           IT       3   West
4     5           8        Sales      14  South
5     6          55           HR      66   West

In [19]:
df.loc[df['Profit']>=78]

   S.no  Sales 2015        Dept.  Profit Region
2     3          78  Counselling      78   West

In [20]:
df.loc[df['Profit']>=78,'Dept.']

2    Counselling
Name: Dept., dtype: object

In [21]:
df.loc[df['Profit']>=78,['Dept.','Region']]

         Dept. Region
2  Counselling   West

In [22]:
#iloc
df

   S.no  Sales 2015        Dept.  Profit Region
0     1          23  Electronics      56   East
1     2          45    Marketing      45  North
2     3          78  Counselling      78   West
3     4          34           IT       3   West
4     5           8        Sales      14  South
5     6          55           HR      66   West

In [23]:
df.iloc(0)

In [24]:
df.iloc[0]

S.no                    1
Sales 2015             23
Dept.         Electronics
Profit                 56
Region               East
Name: 0, dtype: object

In [25]:
df.iloc[[0]]

   S.no  Sales 2015        Dept.  Profit Region
0     1          23  Electronics      56   East

In [26]:
df.iloc[[1,5]]

   S.no  Sales 2015      Dept.  Profit Region
1     2          45  Marketing      45  North
5     6          55         HR      66   West

In [29]:
#boolean
df.iloc[[True,False,True,False,False,True]]

   S.no  Sales 2015        Dept.  Profit Region
0     1          23  Electronics      56   East
2     3          78  Counselling      78   West
5     6          55           HR      66   West

In [36]:
#slicing
df.iloc[0:4:2]

   S.no  Sales 2015        Dept.  Profit Region
0     1          23  Electronics      56   East
2     3          78  Counselling      78   West

In [37]:
df.iloc[0:4,2]

0    Electronics
1      Marketing
2    Counselling
3             IT
Name: Dept., dtype: object

In [38]:
df.iloc[0:4,[2]]

         Dept.
0  Electronics
1    Marketing
2  Counselling
3           IT

In [39]:
df.iloc[0:4,[2,1]]

         Dept.  Sales 2015
0  Electronics          23
1    Marketing          45
2  Counselling          78
3           IT          34